# BuiltInFailures.SweepFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SweepFailures Class
BuiltInFailures Class Members See Also
---
Failures about Sweep.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SweepFailures
```

Visual Basic
---
```text
Public NotInheritable Class SweepFailures
```

Visual C++
---
```text
public ref class SweepFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SweepFailures
# See Also
BuiltInFailures..::..SweepFailures Members
Autodesk.Revit.DB Namespace